Terraform Plan Output:
```
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=05255e48-c18f-43d7-8828-d1372ce4ad1f]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=hello-kitty-role-function-davudh15]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this: Refreshing state... [id=davudh-15]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this: Refreshing state... [id=davudh-15]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=davudh-15]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=davudh-15]
module.appcd_e26aeaa0-8250-4383-b98b-f90a82b3c8b5.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-function-davudh15:aws_s3-hello-kitty-policy]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0]: Refreshing state... [id=alias/s3-davudh-15]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "hello-kitty-function-davudh-15"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::222634395437:role/hello-kitty-role-function-davudh15"
      + runtime                        = "python3.8"
      + s3_bucket                      = "stackgen-builds"
      + s3_key                         = "build/app.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "appstack"  = "hello-kitty-shaik"
          + "component" = "hello-kitty"
        }
      + tags_all                       = {
          + "appstack"  = "hello-kitty-shaik"
          + "component" = "hello-kitty"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "IMAGES_BUCKET" = "davudh-15"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0] will be created
  + resource "aws_lambda_function_url" "this" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "hello-kitty-function-davudh-15"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)
    }

  # module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/hello-kitty-function-00091112"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "appstack"  = "hello-kitty-shaik"
          + "component" = "hello-kitty"
        }
      + tags_all          = {
          + "appstack"  = "hello-kitty-shaik"
          + "component" = "hello-kitty"
        }
    }

  # module.appcd_c2381f17-4f27-4d2d-913d-2e6d9b10badf.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "Writer"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "hello-kitty-role-function-davudh15"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_00091112_arn  = (known after apply)
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_00091112_name = "/aws/lambda/hello-kitty-function-00091112"
  - aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_name          = "/aws/lambda/hello-kitty-function" -> null
  + aws_lambda_hello_kitty_function_davudh_15_function_arn                 = (known after apply)
  + aws_lambda_hello_kitty_function_davudh_15_function_url                 = (known after apply)
  + aws_lambda_hello_kitty_function_davudh_15_invoke_arn                   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```